# Ripasso iniziale

In [1]:
import pandas as pd

datas = {'Nome':['Aldo', 'Giovanni', 'Giacomo'],
         'Età':[10,18,28]}

dataframe = pd.DataFrame(datas)
print(dataframe)

       Nome  Età
0      Aldo   10
1  Giovanni   18
2   Giacomo   28

In [2]:
df_olders = dataframe[dataframe['Età'] > 20]
df_olders

      Nome  Età
2  Giacomo   28

In [3]:
dataframe['Maggiorenne'] = dataframe['Età'] >= 18
dataframe

       Nome  Età  Maggiorenne
0      Aldo   10        False
1  Giovanni   18         True
2   Giacomo   28         True

In [7]:
import numpy as np
datas = {'Nome':['Aldo', 'Giovanni', 'Giacomo', 'Alessandro', 'Aldo'],
         'Età':[10,18,28, np.nan, 10],
         'Città':['Bologna', 'Bologna', 'Bologna', 'Bologna', 'Bologna'] }
df = pd.DataFrame(datas)
df.dropna()

       Nome   Età    Città
0      Aldo  10.0  Bologna
1  Giovanni  18.0  Bologna
2   Giacomo  28.0  Bologna
4      Aldo  10.0  Bologna

In [8]:
df = df.drop_duplicates()
df

         Nome   Età    Città
0        Aldo  10.0  Bologna
1    Giovanni  18.0  Bologna
2     Giacomo  28.0  Bologna
3  Alessandro   NaN  Bologna

# Esercizio 1

In [20]:
import pandas as pd
import numpy as np
import random

names = ['Giuseppe', 'Aldo', 'Alex', 'Marco', 'Mirko', 'Chiara', 'Sara', 'Elisa', 'Giuseppina']
cities = ['Roma', 'Bologna', 'Trento', 'Milano', 'Cosenza', 'Taranto', 'Latina', 'Torino', 'Genova']

ages = np.random.randint(14,50, 25)
salaries = np.random.randint(1500, 3500, 25)
data_names = [random.choice(names) for _ in range(25)]
data_cities = [random.choice(cities) for _ in range(25)]

In [22]:
datas = {'Nomi': data_names,
         'Città': data_cities,
         'Età': ages,
         'Salario': salaries}

df = pd.DataFrame(datas)

In [23]:
df.head()

         Nomi    Città  Età  Salario
0        Aldo   Trento   38     3412
1        Sara   Milano   20     2879
2      Chiara  Cosenza   22     1949
3  Giuseppina   Torino   37     2987
4        Alex  Taranto   42     3377

In [24]:
df.tail()

      Nomi    Città  Età  Salario
20  Chiara   Genova   45     2118
21   Elisa  Cosenza   26     2607
22   Mirko  Bologna   39     1976
23   Marco   Milano   32     2308
24  Chiara  Taranto   45     2946

In [27]:
df.dtypes

Nomi       object
Città      object
Età         int32
Salario     int32
dtype: object

In [28]:
df.describe()

            Età      Salario
count  25.00000    25.000000
mean   29.24000  2670.920000
std     9.98866   572.626108
min    14.00000  1637.000000
25%    20.00000  2236.000000
50%    30.00000  2766.000000
75%    37.00000  3192.000000
max    45.00000  3469.000000

In [29]:
df.drop_duplicates()
df.tail()

      Nomi    Città  Età  Salario
20  Chiara   Genova   45     2118
21   Elisa  Cosenza   26     2607
22   Mirko  Bologna   39     1976
23   Marco   Milano   32     2308
24  Chiara  Taranto   45     2946